{
    "paper_authors_list": [
        "Turan, Mehmet", 
        "Pilavci, Yusuf Yigit", 
        "Jamiruddin, Redhwan", 
        "Araujo, Helder", 
        "Konukoglu, Ender", 
        "Sitti, Metin"
    ], 
    "paper_comments": null, 
    "paper_page_url": "https://arxiv.org/abs/1705.06524", 
    "paper_abstract": "In the gastrointestinal (GI) tract endoscopy field, ingestible wireless\ncapsule endoscopy is emerging as a novel, minimally invasive diagnostic\ntechnology for inspection of the GI tract and diagnosis of a wide range of\ndiseases and pathologies. Since the development of this technology, medical\ndevice companies and many research groups have made substantial progress in\nconverting passive capsule endoscopes to robotic active capsule endoscopes with\nmost of the functionality of current active flexible endoscopes. However,\nrobotic capsule endoscopy still has some challenges. In particular, the use of\nsuch devices to generate a precise three-dimensional (3D) mapping of the entire\ninner organ remains an unsolved problem. Such global 3D maps of inner organs\nwould help doctors to detect the location and size of diseased areas more\naccurately and intuitively, thus permitting more reliable diagnoses. To our\nknowledge, this paper presents the first complete pipeline for a complete 3D\nvisual map reconstruction of the stomach. The proposed pipeline is modular and\nincludes a preprocessing module, an image registration module, and a final\nshape-from-shading-based 3D reconstruction module; the 3D map is primarily\ngenerated by a combination of image stitching and shape-from-shading\ntechniques, and is updated in a frame-by-frame iterative fashion via capsule\nmotion inside the stomach. A comprehensive quantitative analysis of the\nproposed 3D reconstruction method is performed using an esophagus gastro\nduodenoscopy simulator, three different endoscopic cameras, and a 3D optical\nscanner.", 
    "paper_subjects": null, 
    "paper_code": "1705.06524", 
    "paper_submission_date": "2017/05/18", 
    "paper_title": "A fully dense and globally consistent 3D map reconstruction approach for GI tract to enhance therapeutic relevance of the endoscopic capsule robot"
}